#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # time_static.creation will be created
  + resource "time_static" "creation" {
      + day     = (known after apply)
      + hour    = (known after apply)
      + id      = (known after apply)
      + minute  = (known after apply)
      + month   = (known after apply)
      + rfc3339 = (known after apply)
      + second  = (known after apply)
      + unix    = (known after apply)
      + year    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + context             = {
      + attributes               = []
      + aws_account_id           = ""
      + aws_partition            = "aws"
      + aws_region               = "us-east-1"
      + delimiter                = "-"
      + enabled                  = true
      + environment              = null
      + id_length_limit          = 0
      + key_case                 = "title"
      + label_order              = [
          + "namespace",
          + "environment",
          + "stage",
          + "name",
          + "attributes",
        ]
      + labels_as_tags           = true
      + name                     = null
      + namespace                = null
      + prefix_external_employee = "organization/external/employee"
      + prefix_external_service  = "organization/external/service"
      + prefix_internal_employee = "organization/internal/employees"
      + prefix_internal_service  = "organization/internal/service"
      + regex_replace_chars      = "/[^a-zA-Z0-9-]/"
      + stage                    = null
      + tags                     = {
          + Attributes        = null
          + Environment       = null
          + Name              = null
          + Namespace         = null
          + Stage             = null
          + creation_time     = (known after apply)
          + git_repo          = "Https://Github.Com/PimpMyNines/Terraform-Module-Labels"
          + last_modified_by  = ""
          + monitored_by      = "Cloudwatch"
          + terraform_managed = "True"
        }
      + tenant                   = null
      + value_case               = "lower"
    }
  + delimiter           = "-"
  + enabled             = true
  + id                  = ""
  + id_length_limit     = 0
  + label_order         = [
      + "namespace",
      + "environment",
      + "stage",
      + "name",
      + "attributes",
    ]
  + regex_replace_chars = "/[^a-zA-Z0-9-]/"
  + tags                = {}

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @tuxtek, Action: `pull_request`*